[
  {
    "id": 1,
    "intro": "The Hawks currently own the second-longest drought (behind the Sacramento Kings) of not winning an NBA championship at 63 seasons. The franchise's lone NBA championship, as well as all four NBA Finals appearances, occurred when the team was based in St. Louis. Meanwhile, they went 48 years without advancing past the second round of the playoffs in any format, until finally breaking through in 2015. However, the Hawks are one of only four NBA teams that have qualified to play in the NBA playoffs in 10 consecutive seasons in the 21st century. They achieved this feat between 2008 and 2017.",
    "url": "https://en.wikipedia.org/wiki/Atlanta_Hawks"
  },
  {
    "id": 2,
    "intro": "In the 1980s, the Celtics returned to dominance, as well as renewed competition with the \"Showtime\" Lakers, who were led by Magic Johnson and Kareem Abdul-Jabbar. Anchored by the \"Big Three\" of Larry Bird, Kevin McHale, and Robert Parish, the Celtics won championships in 1981, 1984, and 1986. The team defeated the Lakers in the 1984 Finals, but lost to Los Angeles in 1985 and 1987. After the departure of Parish as a free agent and the retirement of both Bird and McHale, the team struggled through the 1990s and much of the early 2000s. It was not until the Celtics assembled a new \"Big Three\" of Kevin Garnett, Paul Pierce, and Ray Allen that they found success once again. Under the leadership of head coach Doc Rivers, the team beat the Lakers to win a championship in 2008, but lost to Los Angeles in a seven-game series in 2010, the latest Finals matchup between the two ancient rivals. ",
    "url": "https://en.wikipedia.org/wiki/Boston_Celtics"
  },
  {
    "id": 3,
    "intro": "In 1977, the team returned to New Jersey and played as the New Jersey Nets from 1977 to 2012. Led by star point guard Jason Kidd, the Nets reached the finals of two consecutive NBA seasons (2001-02 and 2002-03), but failed to win either title. In the summer of 2012, the team moved to Barclays Center in Brooklyn, becoming the first major sports franchise in the borough since the departure of the Brooklyn Dodgers baseball team in 1957. Since moving to Brooklyn, the Nets have qualified for the playoffs on seven occasions, including trips to the Conference Semifinals in 2014 and 2021.",
    "url": "https://en.wikipedia.org/wiki/Brooklyn_Nets"
  },
  {
    "id": 4,
    "intro": "The Charlotte Hornets franchise was established in 1988 as an expansion team owned by George Shinn. In 2002, Shinn relinquished his original franchise and acquired a new franchise in New Orleans. Although Shinn was controversially permitted to relocate his basketball organization to that city, an agreement was eventually reached in which Charlotte was permitted to retain the history and records of the team spanning from 1988 to 2002.",
    "url": "https://en.wikipedia.org/wiki/Charlotte_Hornets"
  },
  {
    "id": 5,
    "intro": "The Bulls saw their greatest success during the 1990s when they played a major part in popularizing the NBA worldwide. They are known for having one of the NBA's greatest dynasties, winning six NBA championships between 1991 and 1998 with two three-peats. All six of their championship teams were led by Hall of Famers Michael Jordan, Scottie Pippen, and coach Phil Jackson. The Bulls are the only NBA franchise to win multiple championships while never losing an NBA Finals series in their history.",
    "url": "https://en.wikipedia.org/wiki/Chicago_Bulls"
  },
  {
    "id": 6,
    "intro": "The Cavaliers opened their inaugural season losing their first 15 games and struggled in their early years, placing no better than sixth in the Eastern Conference during their first five seasons. The team won their first Central Division title in 1976, which also marked the first winning season and playoff appearance in franchise history, where they advanced to the Eastern Conference Finals. The franchise was purchased by Ted Stepien in 1980. Stepien's tenure as owner was marked by six coaching changes, questionable trades and draft decisions, and poor attendance, leading to $15 million in financial losses. The Cavs went 66-180 in that time and endured a 24-game losing streak spanning the 1981-82 and 1982-83 seasons. ",
    "url": "https://en.wikipedia.org/wiki/Cleveland_Cavaliers"
  },
  {
    "id": 7,
    "intro": "Throughout the 1980s, the Mavericks were a perennial playoff team, led by All-Stars Rolando Blackman and Mark Aguirre. The team struggled during the 1990s, entering into a period of rebuilding. In 1998, the franchise's fortunes would change drastically with the acquisition of Dirk Nowitzki, who would become the cornerstone of the most successful period in franchise history, leading the team to its first NBA championship in 2011. The Mavericks later entered a rebuilding phase in the tail end of Nowitzki's storied career. They missed the playoffs in three consecutive years from 2017 to 2019, after which Nowitzki retired following his record-breaking 21st season with Dallas. Led by 2019 Rookie of the Year Luka Dončić, the Mavericks returned to the playoffs in 2020 and reached the Western Conference Finals in 2022 for the first time since their 2011 championship. ",
    "url": "https://en.wikipedia.org/wiki/Dallas_Mavericks"
  },
  {
    "id": 8,
    "intro": "The team was founded as the Denver Larks in 1967 as a charter franchise of the American Basketball Association (ABA), but changed their name to Rockets before the first season.[13] The Rockets then changed their name again to the Nuggets in 1974.[14] After the name change, the Nuggets played for the final ABA Championship title in 1976, losing to the New York Nets. ",
    "url": "https://en.wikipedia.org/wiki/Denver_Nuggets"
  },
  {
    "id": 9,
    "intro": "The Pistons compete in the National Basketball Association (NBA) as a member of the league's Eastern Conference Central Division and play their home games at Little Caesars Arena, located in Midtown. Founded in Fort Wayne, Indiana as a semi-professional company basketball team called the Fort Wayne Zollner Pistons in 1937, they would turn pro in 1941 as a member of the National Basketball League (NBL), where they won two NBL championships: in 1944 and 1945. The Pistons later joined the Basketball Association of America (BAA) in 1948. The NBL and BAA merged to become the NBA in 1949, and the Pistons became part of the merged league. In 1957, the franchise moved to Detroit. The Pistons have won three NBA championships: in 1989, 1990 and 2004.",
    "url": "https://en.wikipedia.org/wiki/Detroit_Pistons"
  },
  {
    "id": 10,
    "intro": "Nicknamed the \"Dubs\" as a shortening of \"W's\", the Warriors hold several NBA records: best regular season, most wins in a season (regular season and postseason combined), and best postseason run. Curry and Thompson are generally considered among the greatest backcourts of all time. The Warriors have the third most NBA championships and have the third most Finals appearances; only the Los Angeles Lakers and Boston Celtics have more. Wilt Chamberlain and Stephen Curry have been named the NBA's MVPs while playing for the Warriors, for a total of three MVP awards. The Warriors are the second most valuable NBA franchise and the sixth-highest valued sports franchise in the world, with an estimated value of $4.7 billion.",
    "url": "https://en.wikipedia.org/wiki/Golden_State_Warriors"
  },
  {
    "id": 11,
    "intro": "The Rockets won only 15 games in their debut season as a franchise in 1967. In the 1968 NBA draft, the Rockets were awarded the first overall pick and selected power forward Elvin Hayes, who would lead the team to its first playoff appearance in his rookie season. The Rockets did not finish a season with a winning record for almost a decade until the 1976-77 season, when they traded for All-Star center Moses Malone. Malone went on to win the NBA Most Valuable Player (MVP) award twice while playing with the Rockets and led Houston to the Eastern Conference Finals in his first year with the team. During the 1980-81 season, the Rockets finished the regular season with a 40-42 record but still made the playoffs. Led by Malone, the Rockets reached their first NBA Finals in 1981, becoming only the second team in NBA history to do so with a losing record. They would lose in six games to the 62-20 Boston Celtics, led by Larry Bird, Robert Parish, and future Rockets head coach Kevin McHale. As of 2021, the 1980-81 Rockets are the last team since the 1954-55 Minneapolis Lakers to make it all the way to the NBA Finals with a losing record.",
    "url": "https://en.wikipedia.org/wiki/Houston_Rockets"
  },
  {
    "id": 12,
    "intro": "The Pacers were first established in 1967 as a member of the American Basketball Association (ABA) and became a member of the NBA in 1976 as a result of the ABA-NBA merger. They play their home games at Gainbridge Fieldhouse. The team is named after the state of Indiana's history with the Indianapolis 500's pace cars and with the harness racing industry. The Pacers have won three championships, all in the ABA. The Pacers were NBA Eastern Conference champions in 2000. The team has won nine division titles. Six Hall of Fame players - Reggie Miller, Chris Mullin, Alex English, Mel Daniels, Roger Brown, and George McGinnis - played with the Pacers for multiple seasons.",
    "url": "https://en.wikipedia.org/wiki/Indiana_Pacers"
  },
  {
    "id": 13,
    "intro": "The franchise was founded as the Buffalo Braves in 1970 as an expansion team. Led by Hall of Famer Bob McAdoo, the Braves reached the NBA playoffs three times during their eight seasons in Buffalo. Conflicts with the Canisius Golden Griffins over the Buffalo Memorial Auditorium and the sale of the franchise led to their relocation from Buffalo to San Diego, California in 1978 and subsequent rebranding as the San Diego Clippers, in reference to the sailing ships seen in San Diego Bay.[9] The team saw little success on the court and missed the playoffs during all six of their years in San Diego. ",
    "url": "https://en.wikipedia.org/wiki/Los_Angeles_Clippers"
  },
  {
    "id": 14,
    "intro": "The franchise began with the 1947 purchase of a disbanded team, the Detroit Gems of the National Basketball League (NBL). The new team began playing in Minneapolis, Minnesota, calling themselves the Minneapolis Lakers. Initially a member of the NBL, the Lakers won the 1948 NBL championship before joining the rival Basketball Association of America, where they would win five of the next six championships, led by star George Mikan. After struggling financially in the late 1950s following Mikan's retirement, they relocated to Los Angeles before the 1960-61 season. The Lakers hold the record for NBA's longest winning streak, 33 straight games, set during the 1971-72 season. Twenty-six Hall of Famers have played for Los Angeles, while four have coached the team. Four Lakers—Abdul-Jabbar, Johnson, O'Neal, and Bryant—have won a combined eight NBA MVP awards.",
    "url": "https://en.wikipedia.org/wiki/Los_Angeles_Lakers"
  },
  {
    "id": 15,
    "intro": "The Grizzlies play their home games at FedExForum. The team is owned by Robert Pera. The Grizzlies are currently the only team in the major professional North American sports leagues based in the city of Memphis, and the only professional basketball team in the state of Tennessee. The team was originally established as the Vancouver Grizzlies in the city of Vancouver, Canada, an expansion team that joined the NBA for the 1995-96 season. After the 2000-01 season concluded, the Grizzlies left Vancouver and moved to Memphis.",
    "url": "https://en.wikipedia.org/wiki/Memphis_Grizzlies"
  },
  {
    "id": 16,
    "intro": "Led by Wade and, following a trade for former NBA Most Valuable Player (MVP) Shaquille O'Neal, the Heat won their first NBA title in 2006, after Riley named himself head coach for a second stint. After the departure of O'Neal two years later, the team struggled for the remainder of the 2000s. Riley remained team president, but was replaced as head coach by Erik Spoelstra. In 2010, the Heat signed reigning league MVP LeBron James and NBA All-Star Chris Bosh, creating the \"Big Three\" along with Wade. During their four years together, Spoelstra, James, Wade, and Bosh led the Heat to the NBA Finals in every season, culminating in back-to-back championships in 2012 and 2013. All three departed by 2016, and the team entered a period of rebuilding. After acquiring All-Star Jimmy Butler in 2019, the Heat returned to the NBA Finals in 2020. The Heat acquired six-time NBA All-Star Kyle Lowry in 2021.",
    "url": "https://en.wikipedia.org/wiki/Miami_Heat"
  },
  {
    "id": 17,
    "intro": "The Bucks have won two league championships (1971, 2021), three conference titles (Western: 1971, 1974, Eastern: 2021), and 17 division titles (1971-1974, 1976, 1980-1986, 2001, 2019-2022). They have featured such notable players as Kareem Abdul-Jabbar, Oscar Robertson, Bob Dandridge, Sidney Moncrief, Bob Lanier, Terry Cummings, Glenn Robinson, Ray Allen, Michael Redd, Giannis Antetokounmpo, Khris Middleton and Jrue Holiday among others. Abdul-Jabbar and Antetokounmpo have been named the NBA's Most Valuable Player while playing for the Bucks, for a total of five MVP awards. They both are also the only players to win Finals MVP for the franchise. The Bucks are the only team to have won a championship in both the Eastern and Western conference. ",
    "url": "https://en.wikipedia.org/wiki/Milwaukee_Bucks"
  },
  {
    "id": 18,
    "intro": "Like most expansion teams, the Timberwolves struggled in their early years, but after the acquisition of Kevin Garnett in the 1995 NBA draft, the team qualified for the playoffs in eight consecutive seasons from 1997 to 2004. Despite losing in the first round in their first seven attempts, the Timberwolves won their first division championship in 2004 and advanced to the Western Conference Finals that same season. Garnett was also named the NBA Most Valuable Player for that season. The team then went into rebuilding mode for more than a decade after missing the postseason in 2005, and trading Garnett to the Boston Celtics in 2007. Garnett returned to the Timberwolves in a February 2015 trade and finished his career there, retiring in the 2016 offseason. The Timberwolves ended a 14-year playoff drought when they returned to the postseason in 2018.",
    "url": "https://en.wikipedia.org/wiki/Minnesota_Timberwolves"
  },
  {
    "id": 19,
    "intro": "The Pelicans were established as the New Orleans Hornets in the 2002-03 season when George Shinn, then owner of the Charlotte Hornets, relocated the franchise to New Orleans. Due to the damage caused by Hurricane Katrina in 2005, the team temporarily relocated to Oklahoma City, where they spent two seasons as the New Orleans/Oklahoma City Hornets before returning to New Orleans for the 2007-08 season. In 2013, the Hornets announced that they would change their name to the New Orleans Pelicans[11] after the 2012-13 season. In 18 seasons of play since the original franchise relocated from Charlotte, the New Orleans franchise has achieved an overall regular season record of 740-864 (.461) and qualified for the playoffs eight times. Their achievements include two playoff series victories and one division title.",
    "url": "https://en.wikipedia.org/wiki/New_Orleans_Pelicans"
  },
  {
    "id": 20,
    "intro": "The team, established by Ned Irish in 1946, was one of the founding members of the Basketball Association of America (BAA), which became the NBA after merging with the rival National Basketball League (NBL) in 1949. The Knicks were successful during their early years and were constant playoff contenders under the franchise's first head coach Joe Lapchick. Beginning in 1950, the Knicks made three consecutive appearances in the NBA Finals, all of which were losing efforts. Lapchick resigned in 1956 and the team subsequently began to falter. It was not until the late 1960s when Red Holzman became the head coach that the Knicks began to regain their former dominance. Holzman successfully guided the Knicks to two NBA championships, in 1970 and 1973. The Knicks of the 1980s had mixed success that included six playoff appearances; however, they failed to participate in the NBA Finals. The playoff-level Knicks of the 1990s were led by future Hall of Fame center Patrick Ewing; this era was marked by passionate rivalries with the Chicago Bulls, Indiana Pacers, and Miami Heat. During this time, they were known for playing tough defense under head coaches Pat Riley and Jeff Van Gundy, making NBA Finals appearances in 1994 and 1999. However, they were unable to win an NBA championship during this era. Since 2000, the Knicks have struggled to regain their former successes, but won their first division title in 19 years in 2012-13, led by a core of forwards Carmelo Anthony and Amar'e Stoudemire. They were eventually eliminated in the Eastern Conference semifinals by the Indiana Pacers, and had failed to make the playoffs for eight years until 2020-21 when they were led by forward Julius Randle and sophomore RJ Barrett, who was selected third overall in the 2019 NBA draft.",
    "url": "https://en.wikipedia.org/wiki/New_York_Knicks"
  },
  {
    "id": 21,
    "intro": "The team was originally established as the Seattle SuperSonics, an expansion team that joined the NBA for the 1967-68 season. The SuperSonics relocated from Seattle, Washington to Oklahoma City in 2008 after a settlement was reached between the ownership group led by Clay Bennett and lawmakers in Seattle following a lawsuit. In Seattle, the SuperSonics qualified for the NBA playoffs 22 times, won their division six times, advanced to three NBA Finals, and won the 1979 NBA Championship. In Oklahoma City, the Thunder qualified for their first playoff berth during the 2009-10 season. They won their first division title as the Thunder in the 2010-11 season and their first Western Conference championship as the Thunder in the 2011-12 season, appearing in the NBA Finals for the fourth time in franchise history and first time since 1996, when the team was based in Seattle. The team has yet to win a championship since moving to Oklahoma City.",
    "url": "https://en.wikipedia.org/wiki/Oklahoma_City_Thunder"
  },
  {
    "id": 22,
    "intro": "The Orlando Magic are an American professional basketball team based in Orlando, Florida. The Magic compete in the National Basketball Association (NBA) as a member of the league's Eastern Conference Southeast Division. The franchise was established in 1989 as an expansion franchise, and such notable NBA stars as Shaquille O'Neal, Penny Hardaway, Grant Hill, Tracy McGrady, Dwight Howard, Jameer Nelson, Rashard Lewis and Nikola Vučević have played for the club throughout its history. As of 2021, the franchise has played in the NBA playoffs 16 times in 32 seasons, and twice went to the NBA Finals, in 1995 and 2009. Orlando has been the second most successful of the four expansion teams brought into the league in 1988 and 1989 in terms of winning percentage and playoff success, after the Miami Heat.",
    "url": "https://en.wikipedia.org/wiki/Orlando_Magic"
  },
  {
    "id": 23,
    "intro": "The Philadelphia 76ers, colloquially known as the Sixers, are an American professional basketball team based in the Philadelphia metropolitan area. The 76ers compete in the National Basketball Association (NBA) as a member of the league's Eastern Conference Atlantic Division and play at the Wells Fargo Center located in the South Philadelphia Sports Complex. Founded in 1946 and originally known as the Syracuse Nationals, they are one of the oldest franchises in the NBA and one of only eight (out of 23) to survive the league's first decade. The 76ers have had a prominent history, with many Hall of Fame players having played for the organization, including Dolph Schayes, Hal Greer, Wilt Chamberlain, Chet Walker, Billy Cunningham, Julius Erving, Maurice Cheeks, Bobby Jones, Moses Malone, Charles Barkley, George McGinnis, and Allen Iverson. They have won three NBA championships, with their first coming under their previous name, the Syracuse Nationals, in 1955. The second title came in 1967, a team which was led by Chamberlain. The third title came in 1983, won by a team led by Erving and Malone. The 76ers have only been back to the NBA Finals once since then: in 2001, where they were led by Iverson and lost to the Los Angeles Lakers in five games. Chamberlain, Erving, Malone and Iverson have been named the NBA's Most Valuable Player while playing for the 76ers, for a total of six MVP awards. ",
    "url": "https://en.wikipedia.org/wiki/Philadelphia_76ers"
  },
  {
    "id": 24,
    "intro": "The Suns are the only team in their division not to be based in California, and play their home games at the Footprint Center. The Suns are one of four major league sports teams based in the Phoenix area, but are the only one to bill themselves as representing the city (the other teams - the Cardinals, Coyotes, and Diamondbacks - all bill themselves as representing the state of Arizona).",
    "url": "https://en.wikipedia.org/wiki/Phoenix_Suns"
  },
  {
    "id": 25,
    "intro": "The Trail Blazers are the only NBA team based in the Pacific Northwest, after the Vancouver Grizzlies relocated to Memphis and became the Memphis Grizzlies in 2001 and the Seattle SuperSonics relocated to Oklahoma City and became the Oklahoma City Thunder in 2008. The team has advanced to the NBA Finals three times, winning the NBA championship once in 1977. Their other NBA Finals appearances were in 1990 and 1992. The team has qualified for the playoffs in 37 seasons of their 51-season existence, including a streak of 21 straight appearances from 1983 through 2003, tied for the second longest streak in NBA history. The Trail Blazers' 34 playoff appearances rank third in the NBA only behind the Los Angeles Lakers and San Antonio Spurs since the team's inception in 1970.",
    "url": "https://en.wikipedia.org/wiki/Portland_Trail_Blazers"
  },
  {
    "id": 26,
    "intro": "The Kings are the first and only team in the major professional North American sports leagues located in Sacramento. The team plays its home games at the Golden 1 Center. Their best seasons to date in the city were in the early 2000s, including a very successful 2001-02 season when they had the best record in the NBA at 61-21 (a winning percentage of .744). The franchise began with the Rochester Seagrams (a semi-professional team) from Rochester, New York, that formed in 1923 and hosted a number of teams there over the next 20 years. They joined the National Basketball League in 1945 as the renamed Rochester Royals,[1] winning that league's championship in their first season, 1945-46. They later jumped with three other NBL teams to the Basketball Association of America, forerunner of the NBA, in 1948. As the Royals, the team was often successful on the court, winning the NBA championship in 1951. The team, however, found it increasingly difficult to turn a profit in the comparatively small market of Rochester and relocated to Cincinnati in 1957, becoming the Cincinnati Royals.",
    "url": "https://en.wikipedia.org/wiki/Sacramento_Kings"
  },
  {
    "id": 27,
    "intro": "The Spurs are one of four former American Basketball Association (ABA) teams to remain intact in the NBA after the 1976 ABA-NBA merger and are the only former ABA team to have won an NBA championship. The franchise has won NBA championships in 1999, 2003, 2005, 2007, and 2014. As of the 2019-20 season, the Spurs had the highest winning percentage among active NBA franchises. As of May 2017, the Spurs had the best winning percentage of any franchise in the major professional sports leagues in the United States and Canada over the previous three decades. From 1999-2000 to 2016-17, the Spurs won 50 games each season, setting a record of 18 consecutive 50-win seasons. In the 2018-19 season, the Spurs matched an NBA record for most consecutive playoff appearances with 22. The team's recent success has coincided with the tenure of current head coach Gregg Popovich and with the playing careers of Spurs icons David Robinson (1989-2003) and Tim Duncan (1997-2016). Throughout the 2022 season, the Spurs will celebrate the club's 50th anniversary.",
    "url": "https://en.wikipedia.org/wiki/San_Antonio_Spurs"
  },
  {
    "id": 28,
    "intro": "The Toronto Raptors are a Canadian professional basketball team based in Toronto. The Raptors compete in the National Basketball Association (NBA) as a member of the league's Eastern Conference Atlantic Division. They play their home games at Scotiabank Arena, which they share with the Toronto Maple Leafs of the National Hockey League (NHL). The team was founded in 1995 as part of the NBA's expansion into Canada, along with the Vancouver Grizzlies. Since the 2001-02 season, the Raptors have been the only Canadian-based team in the league, as the Grizzlies relocated from Vancouver to Memphis, Tennessee.",
    "url": "https://en.wikipedia.org/wiki/Toronto_Raptors"
  },
  {
    "id": 29,
    "intro": "The Jazz were one of the least successful teams in the league in their early years. Although 10 seasons elapsed before the Jazz qualified for their first playoff appearance in 1984, they did not miss the playoffs again until 2004. During the late 1980s, John Stockton and Karl Malone arose as the franchise players for the team and formed one of the most famed pick and roll duos in NBA history. Led by coach Jerry Sloan, who took over from Frank Layden in 1988, they became one of the powerhouse teams of the 1990s, culminating in two NBA Finals appearances in 1997 and 1998, where they lost both times to the Chicago Bulls, led by Michael Jordan.",
    "url": "https://en.wikipedia.org/wiki/Utah_Jazz"
  },
  {
    "id": 30,
    "intro": "The team plays its home games at the Capital One Arena, in the Chinatown neighborhood of Washington, D.C. The franchise was established in 1961 as the Chicago Packers in Chicago, Illinois; they were renamed the Chicago Zephyrs in the following season. In 1963, they moved to Baltimore, Maryland, and became the Baltimore Bullets, taking the name from a previous team of the same name. In 1973, the team moved to the Washington metropolitan area and changed its name first to the Capital Bullets, then the following season to Washington Bullets. In 1997, they rebranded themselves as the Wizards.",
    "url": "https://en.wikipedia.org/wiki/Washington_Wizards"
  }
]
